<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html40/strict.dtd">
<html>
<head>
  <title> SADAA manual de usuario </title>
  <meta name="author" content="Pedro Cardoso Rodriguez" lang="es">
  <link rel="stylesheet" href="estilo.css" media="screen" type="text/css">
</head>

<body>
<!-- titulo -->
<h1>Men&uacute; Catalogo bibliogr&aacute;fico</h1>
<!-- menu/submenu -->
<p class="mnu">
<a href="index.html"> Como iniciar </a>|
<a href="sistema.html"> Sistema </a>|
<a href="alumnos.html"> Alumnos </a>|
<a href="grupos.html"> Grupos </a>|
<a href="asesorias.html"> Asesor&iacute;as a tesistas </a>|
<span class="act"> Catalogo bibliogr&aacute;fico </span><br>
<a href="#catsfi" class="submenu"> Fichas que maneja el catalogo </a>|
<a href="#nuevafi" class="submenu"> Crear una ficha </a>|
<a href="#impfi" class="submenu"> Imprimir una ficha </a>|
<a href="#buscafi" class="submenu"> Buscar una ficha(s) </a>
<blockquote>
</p>
<!-- contenido -->
<div class="cont">
<p> El sistema proporciona soporte para manejar un catalogo bibliogr&aacute;fico b&aacute;sico para guardar fichas
bibliogr&aacute;ficas, hemeroteca y hemeroteca anal&iacute;tica. Con ello se pretende facilitar labores de b&uacute;squeda
de material de estudio, consulta, investigaci&oacute;n, lectura, referencias.</p>
<h3><a name="catsfi"> Fichas que maneja el catalogo </a></h3>
<p> El catalogo maneja tres tipos de fichas:
<ul>
  <li>Fichas <em>Bibliogr&aacute;ficas</em><br>La ficha bibliogr&aacute;fica se utiliza para identificar un libro
  mediante sus datos generales, puede catalogar un libro, tesis, compendio, antolog&iacute;a, investigaci&oacute;n
  u otros documentos generales para lo cual debe emplear los campos que apliquen a cada caso en particular.<br>
  Algunos de los campos de esta ficha de uso particular son:
  <ul>
    <li>Lugar de consulta: indica el lugar de consulta del libro o documento, por ejemplo biblioteca municipal,
    biblioteca escolar, biblioteca personal, referencia a material digital.</li>
    <li>Prologuista: Aplica para libros o documentos con un estudio o pr&oacute;logo preliminar, indica la persona que realizo
    dicho prologo.</li>
    <li>Compilador: Aplica para compilaciones o antolog&iacute;as y se refiere al nombre de la persona
    que compilo los art&iacute;culos contenidos en el documento.</li>
    <li>Traductor: Aplica para libros o documentos de idioma original distinto al de esa edici&oacute;n.</li>
    <li>Colecci&oacute;n o serie: Aplica para libros o documentos que pertenecen a una colecci&oacute;n o serie.</li>
    <li>Volumen o tomo: Aplica para libros o documentos que pertenecen a una colecci&oacute;n o serie numerada.</li>
    <li>Resumen: Campo opcional se recomienda llenarlo siempre tratando de sintetizar la esencia del contenido del
    libro o documento (su contenido tambi&eacute;n es utilizado por el sistema para b&uacute;squedas gen&eacute;ricas 
    por medio de palabras clave)</li>
    <li>Palabras clave: Campo opcional se recomienda llenarlo siempre su contenido es utilizado por el sistema
    para b&uacute;squedas gen&eacute;ricas por medio de palabras clave</li>
  </ul>
  </li>
  <li>Fichas <em>Hemeroteca general</em><br>La ficha Hemeroteca se utiliza para identificar publicaciones
    peri&oacute;dicas tales como revistas, publicaciones mensuales, quincenales, semanales, diarios, peri&oacute;dicos.
  </li>
  <li>Fichas <em>Hemeroteca anal&iacute;tica</em><br>La ficha Hemeroteca anal&iacute;tica se utiliza para identificar
  art&iacute;culos espec&iacute;ficos dentro de publicaciones peri&oacute;dicas. Los campos de esta ficha deben identificar tanto los
  datos del articulo como de la publicaci&oacute;n a la cual pertenece.<br>Notas sobre algunos campos de esta ficha.<br>
  <ul>
    <li>Fecha: indica la fecha de publicaci&oacute;n del material que contiene el art&iacute;culo.</li>
    <li>A&ntilde;o: Indica el numero de a&ntilde;o de existencia de la publicaci&oacute;n y se escribe siempre
    mediante numeraci&oacute;n romana.</li>
    <li>Numero: Indica el numero de ejemplar de la publicaci&oacute;n.</li>
  </ul>
  </li>
</ul>
<img src="img/fichabg.jpg"><br>
<img src="img/fichahg.jpg"><br>
<img src="img/fichaha.jpg">
</p>
<h3><a name="nuevafi"> Crear una ficha </a></h3>
<p> Para crear una ficha:
<ul>
  <li>Haga click en el men&uacute; <em>Catalogo bibliogr&aacute;fico</em></li>
  <li>Haga click en el submen&uacute; <em>Nueva ficha</em></li>
  <li>Elija la categor&iacute;a de la nueva ficha bibliogr&aacute;fica.</li>
  <li>Haga click en el bot&oacute;n <em>Elegir</em></li>
  <li>Llene los campos con los datos correspondientes</li>
  <li>Haga click en el bot&oacute;n <em>Guardar</em> <img src="img/guarda.jpg"></li>
  <li>Si los datos son correctos se creara el registro de la ficha, posteriormente si desea modificar alg&uacute;n
  dato puede escribirlo directamente sobre el campo correspondiente y guardar el cambio con el bot&oacute;n guardar</li>
  <li>Si desea eliminar la ficha puede hacerlo haciendo click en el bot&oacute;n <em>Eliminar</em><img src="img/elimina.jpg"></li>
</ul>
<img src="img/selficha.jpg">
</p>
<h3><a name="impfi"> Imprimir una ficha </a></h3>
<p> Para imprimir una ficha:
<ul>
  <li>Una vez que tenga abierto el registro (de cualquier tipo de ficha)</li>
  <li>Haga click en el bot&oacute;n <em>Imprimir</em> <img src="img/impresora.jpg"></li>
  <li>El sistema desplegara un cuadro de dialogo para que elija la impresora y n&uacute;mero de copias, una vez hecho esto
  al enviar a imprimir debe considerar que el sistema enviara la ficha con un formato de papel de 74 mm X 105 mm
  (especificaci&oacute;n ISO A7) </li>
</ul>
</p>
<h3><a name="buscafi"> Buscar una ficha </a></h3>
<p> Para buscar fichas registradas en el sistema:
<ul>
  <li>Haga click en el men&uacute; <em>Catalogo bibliogr&aacute;fico</em></li>
  <li>Haga click en el submen&uacute; <em>Buscar ficha</em></li>
  <li>Elija la categor&iacute;a de ficha a buscar.<br>Tambi&eacute;n puede elegir la categor&iacute;a <em>Cualquier referencia</em> la 
  cual buscara fichas de todos los tipos (Bibliogr&aacute;fica, Hemeroteca y Hemeroteca anal&iacute;tica)</li>
  <li>Ingrese el valor de al menos un campo de b&uacute;squeda</li>
  <li>Si va a usar dos o m&aacute;s campos de b&uacute;squeda seleccione si desea que la b&uacute;squeda muestre
    resultados que cumplan <em>al menos un criterio</em> o <em>todos los criterios</em><br>(Por ejemplo
    si busca titulo=Investigaci&oacute;n y autor=Lorenzo y selecciona la opci&oacute;n <em>al menos un criterio</em>
    se buscara material titulado Investigaci&oacute;n o de autores llamados Lorenzo; con la otra opci&oacute;n
    se buscara material titulado Investigaci&oacute;n y de autores llamados Lorenzo)</li>
  <li>Haga click en el bot&oacute;n <em>Buscar</em></li>
  <li>Si se encuentra una sola ficha se abrir&aacute; directamente su registro (del tipo que corresponda)</li>
  <li>Si se encuentran dos o m&aacute;s fichas se abrir&aacute; la ventana de <em>Resultado de b&uacute;squedas</em>
  en la cual haciendo click con el bot&oacute;n derecho del mouse dispondr&aacute; de la opci&oacute;n para abrir
  el registro de cualquiera de las fichas encontradas.</li>
</ul>
<img src="img/fichabus.jpg">
<p id="licencia"> Copyright © 2010 Pedro Cardoso Rodríguez. Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.2 or any later version published by the Free Software Foundation;
with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section 
entitled "GNU Free Documentation License". </p>
</p>
</div>
</blockquote>
</body>
</html>
